### [군집데이터]

In [24]:
print(True == False)
print(True != 0)
print(False == 0)
print(True or False)
print(1 =='1')

False
True
True
True
False

In [25]:
eng= 'Korea COVID 19'
print(eng.lower())
print(eng.upper())

korea covid 19
KOREA COVID 19

In [31]:
data=[]
data.append('java')
data.append('python')
data.append('him')
data

['java', 'python', 'him']

In [41]:
data[0]

'python'

In [42]:
data[-1]

'him'

In [43]:
data[1:]

['java', 'him']

In [44]:
data[2:]

['him']

In [47]:
data.sort()
data

['him', 'java', 'python']

In [61]:
data.reverse()
data

['him', 'java', 'python']

In [62]:
b=(1,2,3, '사','오')
c=1,2,3
type(b), type(c)
#b[3]=4
b[3:], b[1:4]

(('사', '오'), (2, 3, '사'))

In [70]:
dic = {'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}

In [71]:
dic.get('name1')

'경민'

In [72]:
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [68]:
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [74]:
lunch = {'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}

In [76]:
lunch & dinner

{10000, '라면', '콜라'}

In [78]:
dinner| lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [79]:
import pandas as pd

In [82]:
li = [1,2,3]
li

[1, 2, 3]

In [84]:
type(li)

list

In [87]:
s1=pd.core.series.Series(li)
s1

0    1
1    2
2    3
dtype: int64

In [88]:
s2=pd.core.series.Series(['일','이','삼'])
s2

0    일
1    이
2    삼
dtype: object

In [91]:
data=dict(num=s1, word=s2)
data

{'num': 0    1
 1    2
 2    3
 dtype: int64, 'word': 0    일
 1    이
 2    삼
 dtype: object}

In [93]:
pd.DataFrame(data)

   num word
0    1    일
1    2    이
2    3    삼

In [99]:
data=pd.DataFrame([['a',100],['b',200],['c',300]])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [102]:
data.head(2)

   0    1
0  a  100
1  b  200

In [105]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [107]:
col=['1군','2군']

In [110]:
pd.DataFrame([['a',100],['b',200],['c',300]],columns=col)

  1군   2군
0  a  100
1  b  200
2  c  300

In [137]:
man=[
    {'Name':'은주','Age':20,'Job':'J1'},
    {'Name':'민서','Age':30,'Job':'J2'},
    {'Name':'경민','Age':15,'Job':'J1'}
]
pd.DataFrame(man,index=[1,2,3])

  Name  Age Job
1   은주   20  J1
2   민서   30  J2
3   경민   15  J1

In [143]:
a=[1,2,3]
b=[4,5,6]
df=[a,b]
dd=pd.DataFrame(df, index=[1,2],columns=['A','B','C'])
dd

   A  B  C
1  1  2  3
2  4  5  6